{"modelTopology": {"keras_version": "2.1.5", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "crepe_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1024], "dtype": "float32", "sparse": false, "name": "crepe_input"}, "inbound_nodes": []}, {"name": "crepe_input_reshape", "class_name": "Reshape", "config": {"name": "crepe_input_reshape", "trainable": true, "target_shape": [1024, 1, 1]}, "inbound_nodes": [[["crepe_input", 0, 0, {}]]]}, {"name": "crepe_conv1", "class_name": "Conv2D", "config": {"name": "crepe_conv1", "trainable": true, "filters": 128, "kernel_size": [512, 1], "strides": [4, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["crepe_input_reshape", 0, 0, {}]]]}, {"name": "crepe_conv1_BN", "class_name": "BatchNormalization", "config": {"name": "crepe_conv1_BN", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["crepe_conv1", 0, 0, {}]]]}, {"name": "crepe_conv1_maxpool", "class_name": "MaxPooling2D", "config": {"name": "crepe_conv1_maxpool", "trainable": true, "pool_size": [2, 1], "padding": "valid", "strides": [2, 1], "data_format": "channels_last"}, "inbound_nodes": [[["crepe_conv1_BN", 0, 0, {}]]]}, {"name": "crepe_conv1_dropout", "class_name": "Dropout", "config": {"name": "crepe_conv1_dropout", "trainable": true, "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["crepe_conv1_maxpool", 0, 0, {}]]]}, {"name": "crepe_conv2", "class_name": "Conv2D", "config": {"name": "crepe_conv2", "trainable": true, "filters": 16, "kernel_size": [64, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["crepe_conv1_dropout", 0, 0, {}]]]}, {"name": "crepe_conv2_BN", "class_name": "BatchNormalization", "config": {"name": "crepe_conv2_BN", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["crepe_conv2", 0, 0, {}]]]}, {"name": "crepe_conv2_maxpool", "class_name": "MaxPooling2D", "config": {"name": "crepe_conv2_maxpool", "trainable": true, "pool_size": [2, 1], "padding": "valid", "strides": [2, 1], "data_format": "channels_last"}, "inbound_nodes": [[["crepe_conv2_BN", 0, 0, {}]]]}, {"name": "crepe_conv2_dropout", "class_name": "Dropout", "config": {"name": "crepe_conv2_dropout", "trainable": true, "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["crepe_conv2_maxpool", 0, 0, {}]]]}, {"name": "crepe_conv3", "class_name": "Conv2D", "config": {"name": "crepe_conv3", "trainable": true, "filters": 16, "kernel_size": [64, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["crepe_conv2_dropout", 0, 0, {}]]]}, {"name": "crepe_conv3_BN", "class_name": "BatchNormalization", "config": {"name": "crepe_conv3_BN", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["crepe_conv3", 0, 0, {}]]]}, {"name": "crepe_conv3_maxpool", "class_name": "MaxPooling2D", "config": {"name": "crepe_conv3_maxpool", "trainable": true, "pool_size": [2, 1], "padding": "valid", "strides": [2, 1], "data_format": "channels_last"}, "inbound_nodes": [[["crepe_conv3_BN", 0, 0, {}]]]}, {"name": "crepe_conv3_dropout", "class_name": "Dropout", "config": {"name": "crepe_conv3_dropout", "trainable": true, "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["crepe_conv3_maxpool", 0, 0, {}]]]}, {"name": "crepe_conv4", "class_name": "Conv2D", "config": {"name": "crepe_conv4", "trainable": true, "filters": 16, "kernel_size": [64, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["crepe_conv3_dropout", 0, 0, {}]]]}, {"name": "crepe_conv4_BN", "class_name": "BatchNormalization", "config": {"name": "crepe_conv4_BN", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["crepe_conv4", 0, 0, {}]]]}, {"name": "crepe_conv4_maxpool", "class_name": "MaxPooling2D", "config": {"name": "crepe_conv4_maxpool", "trainable": true, "pool_size": [2, 1], "padding": "valid", "strides": [2, 1], "data_format": "channels_last"}, "inbound_nodes": [[["crepe_conv4_BN", 0, 0, {}]]]}, {"name": "crepe_conv4_dropout", "class_name": "Dropout", "config": {"name": "crepe_conv4_dropout", "trainable": true, "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["crepe_conv4_maxpool", 0, 0, {}]]]}, {"name": "crepe_conv5", "class_name": "Conv2D", "config": {"name": "crepe_conv5", "trainable": true, "filters": 32, "kernel_size": [64, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["crepe_conv4_dropout", 0, 0, {}]]]}, {"name": "crepe_conv5_BN", "class_name": "BatchNormalization", "config": {"name": "crepe_conv5_BN", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["crepe_conv5", 0, 0, {}]]]}, {"name": "crepe_conv5_maxpool", "class_name": "MaxPooling2D", "config": {"name": "crepe_conv5_maxpool", "trainable": true, "pool_size": [2, 1], "padding": "valid", "strides": [2, 1], "data_format": "channels_last"}, "inbound_nodes": [[["crepe_conv5_BN", 0, 0, {}]]]}, {"name": "crepe_conv5_dropout", "class_name": "Dropout", "config": {"name": "crepe_conv5_dropout", "trainable": true, "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["crepe_conv5_maxpool", 0, 0, {}]]]}, {"name": "crepe_conv6", "class_name": "Conv2D", "config": {"name": "crepe_conv6", "trainable": true, "filters": 64, "kernel_size": [64, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["crepe_conv5_dropout", 0, 0, {}]]]}, {"name": "crepe_conv6_BN", "class_name": "BatchNormalization", "config": {"name": "crepe_conv6_BN", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["crepe_conv6", 0, 0, {}]]]}, {"name": "crepe_conv6_maxpool", "class_name": "MaxPooling2D", "config": {"name": "crepe_conv6_maxpool", "trainable": true, "pool_size": [2, 1], "padding": "valid", "strides": [2, 1], "data_format": "channels_last"}, "inbound_nodes": [[["crepe_conv6_BN", 0, 0, {}]]]}, {"name": "crepe_conv6_dropout", "class_name": "Dropout", "config": {"name": "crepe_conv6_dropout", "trainable": true, "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["crepe_conv6_maxpool", 0, 0, {}]]]}, {"name": "crepe_flatten", "class_name": "Flatten", "config": {"name": "crepe_flatten", "trainable": true}, "inbound_nodes": [[["crepe_conv6_dropout", 0, 0, {}]]]}, {"name": "crepe_classifier", "class_name": "Dense", "config": {"name": "crepe_classifier", "trainable": true, "units": 360, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["crepe_flatten", 0, 0, {}]]]}], "input_layers": [["crepe_input", 0, 0]], "output_layers": [["crepe_classifier", 0, 0]]}}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"lr": 0.0010000000474974513, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false}}, "loss": "binary_crossentropy", "metrics": [], "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "crepe_classifier/kernel", "shape": [256, 360], "dtype": "float32"}, {"name": "crepe_classifier/bias", "shape": [360], "dtype": "float32"}]}, {"paths": ["group2-shard1of1"], "weights": [{"name": "crepe_conv1/kernel", "shape": [512, 1, 1, 128], "dtype": "float32"}, {"name": "crepe_conv1/bias", "shape": [128], "dtype": "float32"}]}, {"paths": ["group3-shard1of1"], "weights": [{"name": "crepe_conv1_BN/gamma", "shape": [128], "dtype": "float32"}, {"name": "crepe_conv1_BN/beta", "shape": [128], "dtype": "float32"}, {"name": "crepe_conv1_BN/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "crepe_conv1_BN/moving_variance", "shape": [128], "dtype": "float32"}]}, {"paths": ["group4-shard1of1"], "weights": [{"name": "crepe_conv2/kernel", "shape": [64, 1, 128, 16], "dtype": "float32"}, {"name": "crepe_conv2/bias", "shape": [16], "dtype": "float32"}]}, {"paths": ["group5-shard1of1"], "weights": [{"name": "crepe_conv2_BN/gamma", "shape": [16], "dtype": "float32"}, {"name": "crepe_conv2_BN/beta", "shape": [16], "dtype": "float32"}, {"name": "crepe_conv2_BN/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "crepe_conv2_BN/moving_variance", "shape": [16], "dtype": "float32"}]}, {"paths": ["group6-shard1of1"], "weights": [{"name": "crepe_conv3/kernel", "shape": [64, 1, 16, 16], "dtype": "float32"}, {"name": "crepe_conv3/bias", "shape": [16], "dtype": "float32"}]}, {"paths": ["group7-shard1of1"], "weights": [{"name": "crepe_conv3_BN/gamma", "shape": [16], "dtype": "float32"}, {"name": "crepe_conv3_BN/beta", "shape": [16], "dtype": "float32"}, {"name": "crepe_conv3_BN/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "crepe_conv3_BN/moving_variance", "shape": [16], "dtype": "float32"}]}, {"paths": ["group8-shard1of1"], "weights": [{"name": "crepe_conv4/kernel", "shape": [64, 1, 16, 16], "dtype": "float32"}, {"name": "crepe_conv4/bias", "shape": [16], "dtype": "float32"}]}, {"paths": ["group9-shard1of1"], "weights": [{"name": "crepe_conv4_BN/gamma", "shape": [16], "dtype": "float32"}, {"name": "crepe_conv4_BN/beta", "shape": [16], "dtype": "float32"}, {"name": "crepe_conv4_BN/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "crepe_conv4_BN/moving_variance", "shape": [16], "dtype": "float32"}]}, {"paths": ["group10-shard1of1"], "weights": [{"name": "crepe_conv5/kernel", "shape": [64, 1, 16, 32], "dtype": "float32"}, {"name": "crepe_conv5/bias", "shape": [32], "dtype": "float32"}]}, {"paths": ["group11-shard1of1"], "weights": [{"name": "crepe_conv5_BN/gamma", "shape": [32], "dtype": "float32"}, {"name": "crepe_conv5_BN/beta", "shape": [32], "dtype": "float32"}, {"name": "crepe_conv5_BN/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "crepe_conv5_BN/moving_variance", "shape": [32], "dtype": "float32"}]}, {"paths": ["group12-shard1of1"], "weights": [{"name": "crepe_conv6/kernel", "shape": [64, 1, 32, 64], "dtype": "float32"}, {"name": "crepe_conv6/bias", "shape": [64], "dtype": "float32"}]}, {"paths": ["group13-shard1of1"], "weights": [{"name": "crepe_conv6_BN/gamma", "shape": [64], "dtype": "float32"}, {"name": "crepe_conv6_BN/beta", "shape": [64], "dtype": "float32"}, {"name": "crepe_conv6_BN/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "crepe_conv6_BN/moving_variance", "shape": [64], "dtype": "float32"}]}]}