{
  "\n": 23,
  " ": 0,
  "!": 67,
  "\"": 154,
  "#": 204,
  "$": 151,
  "%": 144,
  "&": 38,
  "'": 161,
  "(": 69,
  ")": 68,
  "*": 91,
  "+": 172,
  ",": 20,
  "-": 57,
  ".": 22,
  "/": 86,
  "0": 63,
  "1": 43,
  "2": 54,
  "3": 65,
  "4": 73,
  "5": 70,
  "6": 76,
  "7": 77,
  "8": 74,
  "9": 62,
  ":": 47,
  ";": 29,
  "<": 188,
  "=": 125,
  ">": 184,
  "?": 44,
  "@": 122,
  "A": 33,
  "B": 34,
  "C": 42,
  "D": 51,
  "E": 53,
  "F": 55,
  "G": 58,
  "H": 35,
  "I": 26,
  "J": 61,
  "K": 72,
  "L": 39,
  "M": 32,
  "N": 50,
  "O": 56,
  "P": 52,
  "Q": 79,
  "R": 49,
  "S": 30,
  "T": 27,
  "U": 80,
  "V": 60,
  "W": 36,
  "X": 85,
  "Y": 64,
  "Z": 87,
  "[": 45,
  "\\": 181,
  "]": 46,
  "^": 189,
  "a": 3,
  "b": 21,
  "c": 14,
  "d": 11,
  "e": 1,
  "f": 17,
  "g": 18,
  "h": 8,
  "i": 7,
  "j": 59,
  "k": 25,
  "l": 10,
  "m": 13,
  "n": 5,
  "o": 4,
  "p": 19,
  "q": 48,
  "r": 9,
  "s": 6,
  "t": 2,
  "u": 12,
  "v": 24,
  "w": 15,
  "x": 37,
  "y": 16,
  "z": 66,
  "{": 105,
  "|": 163,
  "}": 101,
  "\u00a3": 82,
  "\u00a7": 190,
  "\u00ad": 197,
  "\u00ae": 192,
  "\u00bc": 117,
  "\u00bd": 93,
  "\u00be": 135,
  "\u00c6": 137,
  "\u00c7": 138,
  "\u00c8": 202,
  "\u00c9": 121,
  "\u00ca": 211,
  "\u00e0": 92,
  "\u00e1": 174,
  "\u00e2": 104,
  "\u00e4": 115,
  "\u00e6": 97,
  "\u00e7": 113,
  "\u00e8": 90,
  "\u00e9": 83,
  "\u00ea": 94,
  "\u00eb": 89,
  "\u00ec": 177,
  "\u00ee": 126,
  "\u00ef": 124,
  "\u00f1": 158,
  "\u00f4": 112,
  "\u00f6": 145,
  "\u00f9": 133,
  "\u00fb": 134,
  "\u00fc": 108,
  "\u00ff": 207,
  "\u0101": 146,
  "\u014d": 213,
  "\u0152": 182,
  "\u0153": 109,
  "\u0397": 179,
  "\u039c": 176,
  "\u039d": 193,
  "\u039f": 173,
  "\u03a0": 186,
  "\u03a4": 217,
  "\u03ac": 178,
  "\u03ad": 164,
  "\u03b1": 100,
  "\u03b2": 147,
  "\u03b3": 136,
  "\u03b4": 114,
  "\u03b5": 99,
  "\u03b7": 129,
  "\u03b8": 118,
  "\u03b9": 98,
  "\u03ba": 123,
  "\u03bb": 103,
  "\u03bc": 119,
  "\u03bd": 95,
  "\u03bf": 96,
  "\u03c0": 111,
  "\u03c1": 106,
  "\u03c2": 131,
  "\u03c3": 110,
  "\u03c4": 102,
  "\u03c5": 120,
  "\u03c6": 183,
  "\u03c7": 139,
  "\u03c8": 215,
  "\u03c9": 130,
  "\u03cd": 219,
  "\u03ce": 203,
  "\u03d5": 127,
  "\u03da": 128,
  "\u0410": 187,
  "\u1f00": 143,
  "\u1f01": 169,
  "\u1f02": 171,
  "\u1f04": 153,
  "\u1f05": 168,
  "\u1f10": 140,
  "\u1f14": 170,
  "\u1f15": 212,
  "\u1f1c": 191,
  "\u1f20": 167,
  "\u1f21": 165,
  "\u1f30": 159,
  "\u1f32": 199,
  "\u1f34": 208,
  "\u1f40": 166,
  "\u1f42": 218,
  "\u1f44": 198,
  "\u1f50": 216,
  "\u1f51": 194,
  "\u1f53": 222,
  "\u1f54": 220,
  "\u1f61": 209,
  "\u1f62": 185,
  "\u1f70": 142,
  "\u1f71": 157,
  "\u1f72": 206,
  "\u1f73": 150,
  "\u1f74": 205,
  "\u1f75": 175,
  "\u1f76": 180,
  "\u1f77": 132,
  "\u1f78": 156,
  "\u1f79": 152,
  "\u1f7d": 196,
  "\u1f80": 210,
  "\u1f96": 214,
  "\u1fb6": 162,
  "\u1fc6": 195,
  "\u1fc7": 221,
  "\u1fd6": 149,
  "\u1fe5": 200,
  "\u1fe6": 160,
  "\u1ff3": 148,
  "\u1ff6": 201,
  "\u2009": 116,
  "\u2013": 88,
  "\u2014": 31,
  "\u2018": 71,
  "\u2019": 28,
  "\u201c": 40,
  "\u201d": 41,
  "\u201e": 141,
  "\u2020": 155,
  "\u2026": 78,
  "\u2060": 81,
  "\u25c9": 84,
  "\u2713": 107,
  "\ue0fc": 75
}